<a href="https://colab.research.google.com/github/Sourav-Manik/Python_for_Data_Science/blob/main/Python_Basics.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
import numpy as np
import matplotlib as mpl
%matplotlib inline
import seaborn as sns

In [2]:
df = pd.read_csv("/content/Salaries.csv")

In [3]:
df.head(12)

         rank discipline  phd  service   sex  salary
0        Prof          B   56       49  Male  186960
1        Prof          A   12        6  Male   93000
2        Prof          A   23       20  Male  110515
3        Prof          A   40       31  Male  131205
4        Prof          B   20       18  Male  104800
5        Prof          A   20       20  Male  122400
6   AssocProf          A   20       17  Male   81285
7        Prof          A   18       18  Male  126300
8        Prof          A   29       19  Male   94350
9        Prof          A   51       51  Male   57800
10       Prof          B   39       33  Male  128250
11       Prof          B   23       23  Male  134778

In [4]:
df['rank'].dtype

dtype('O')

In [5]:
df.dtypes

rank          object
discipline    object
phd            int64
service        int64
sex           object
salary         int64
dtype: object

In [6]:
df.shape

(78, 6)

In [7]:
df.columns

Index(['rank', 'discipline', 'phd', 'service', 'sex', 'salary'], dtype='object')

In [8]:
df.describe()

             phd    service         salary
count  78.000000  78.000000      78.000000
mean   19.705128  15.051282  108023.782051
std    12.498425  12.139768   28293.661022
min     1.000000   0.000000   57800.000000
25%    10.250000   5.250000   88612.500000
50%    18.500000  14.500000  104671.000000
75%    27.750000  20.750000  126774.750000
max    56.000000  51.000000  186960.000000

In [9]:
df.std()

phd           12.498425
service       12.139768
salary     28293.661022
dtype: float64

In [10]:
df_50_records = df.head(50)

In [11]:
df_50_records.mean()
# or df.head(50).mean()

phd            21.52
service        17.60
salary     113789.14
dtype: float64

In [12]:
df['salary'].mean()

108023.78205128205

In [13]:
df['salary'].count()

78

In [14]:
df['salary'].describe()

count        78.000000
mean     108023.782051
std       28293.661022
min       57800.000000
25%       88612.500000
50%      104671.000000
75%      126774.750000
max      186960.000000
Name: salary, dtype: float64

In [15]:
df_dis = df.groupby(['discipline'])

In [16]:
df_dis.mean()

                  phd    service         salary
discipline
A           21.527778  15.722222   98331.111111
B           18.142857  14.476190  116331.785714

In [17]:
df.groupby(["rank"])[["service","salary"]].mean()

             service         salary
rank
AssocProf  11.307692   91786.230769
AsstProf    2.210526   81362.789474
Prof       21.413043  123624.804348

In [18]:
df_sal = df['salary']>80000

In [19]:
df_sal.head()

0    True
1    True
2    True
3    True
4    True
Name: salary, dtype: bool

In [20]:
df_sal = df[df['salary']>80000]

In [21]:
df_sal.head()

   rank discipline  phd  service   sex  salary
0  Prof          B   56       49  Male  186960
1  Prof          A   12        6  Male   93000
2  Prof          A   23       20  Male  110515
3  Prof          A   40       31  Male  131205
4  Prof          B   20       18  Male  104800

In [22]:
df_f = df[df['sex']=="Female"]

In [23]:
df_f.head()

         rank discipline  phd  service     sex  salary
39       Prof          B   18       18  Female  129000
40       Prof          A   39       36  Female  137000
41  AssocProf          A   13        8  Female   74830
42   AsstProf          B    4        2  Female   80225
43   AsstProf          B    5        0  Female   77000

In [24]:
df.iloc[0:7]

        rank discipline  phd  service   sex  salary
0       Prof          B   56       49  Male  186960
1       Prof          A   12        6  Male   93000
2       Prof          A   23       20  Male  110515
3       Prof          A   40       31  Male  131205
4       Prof          B   20       18  Male  104800
5       Prof          A   20       20  Male  122400
6  AssocProf          A   20       17  Male   81285

In [25]:
df.iloc[:,0:2]

         rank discipline
0        Prof          B
1        Prof          A
2        Prof          A
3        Prof          A
4        Prof          B
..        ...        ...
73       Prof          B
74  AssocProf          B
75       Prof          B
76       Prof          A
77       Prof          A

[78 rows x 2 columns]

In [26]:
df.iloc[1:8,2:5]

   phd  service   sex
1   12        6  Male
2   23       20  Male
3   40       31  Male
4   20       18  Male
5   20       20  Male
6   20       17  Male
7   18       18  Male

In [27]:
df.iloc[[0,4],[2,3]]

   phd  service
0   56       49
4   20       18

In [28]:
df[['salary','service']].agg(['mean','sem','max'])

             salary    service
mean  108023.782051  15.051282
sem     3203.626259   1.374558
max   186960.000000  51.000000